// ================================================================================
//
//      作 者  :   G Q
//      类 名  :   HEventID
//      时 间  :   2022年11月17日 18:42:25
//      目 的  :   事件码列表
//
// ================================================================================

/// <summary>
/// 事件码
/// </summary>
public enum HEventType
{
    /// <summary>
    /// 游戏开始
    /// </summary>
    GameStart = 0,

    /// <summary>
    /// Lua启动
    /// </summary>
    LuaStart,

    /// <summary>
    /// 游戏结束
    /// </summary>
    GameEnd,
}